app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    if @user.valid?
      if params[:next_step] == 'end'
        @user.save
---
INSERT INTO "users" ("address", "city", "created_at", "updated_at", "login", "email") VALUES(NULL, NULL, '2011-04-07 12:19:24', '2011-04-07 12:19:24', 'eqreq', 'rewqrq')